export const ruleHelper = {
    /** 验证手机号码 */
    phone: {
        reg: /1([3-9]{1})([0-9]{9})$/,
        message: '手机号格式不正确'
    },
    /** 验证邮箱 */
    email: {
        reg: /^(?!admin|test)(([^<>()[\]\\.,;:\s@"]+(\.[^<>()[\]\\.,;:\s@"]+)*)|(".+"))@((\[[0-9]{1,3}\.[0-9]{1,3}\.[0-9]{1,3}\.[0-9]{1,3}\])|(([a-zA-Z\-0-9]+\.)+[a-zA-Z]{2,}))$/,
        message: '邮箱格式不正确'
    },
    /** 不能包含特殊字符 */
    unable_contain_special: {
        reg: /^$|^((?![\\/:*~?<>|'%@$#&$^&*]).)+$/g,
        message: '不能包含特殊字符（~!@#$%^&*?）'
    },
    /** 不能包含中文 */
    unable_contain_chinese: {
        reg: /^[^\u4e00-\u9fa5]+$/,
        message: '不能包含中文'
    },
    /** 只能输入中文 */
    chinese: {
        reg: /^[\u4e00-\u9fa5]+$/,
        message: '只能输入中文'
    },
    /** 只能输入英文字母 */
    eng: {
        reg: /^[a-zA-Z]+$/,
        message: '只能输入英文字母'
    },
    /** 密码验证 */
    password: /^(?=.*[a-zA-Z])(?=.*[0-9])(?=.*[!@#$%^&*?])[a-zA-Z0-9!@#$%^&*?]{8,24}$/,
    /** 必须要包含字母、数字、特殊字符（~!@#$%^&*?） */
    mul_special: {
        reg: /^(?=.*[a-zA-Z])(?=.*[0-9])(?=.*[!@#$%^&*?])[a-zA-Z0-9!@#$%^&*?]{3,}$/,
        message: '必须包含字母、数字、特殊字符（~!@#$%^&*?），且长度为8-24'
    },
    /** 只能包含字母、数字、下划线 */
    only_alphanumeric_underline: {
        reg: /^[a-zA-Z0-9_]+$/,
        message: '只能包含字母、数字、下划线'
    },
    /** 只能包含小写字母和点 */
    only_letter_dot: {
        reg: /^[a-z.]+$/,
        message: '只能包含小写字母和.'
    },
    /** 只能输入字母和下划线 */
    only_eng_udl: {
        reg: /^[a-zA-Z|_]*$/,
        message: '只能输入字母和下划线'
    }
}
